app/Http/Controllers/AdminProductController.php

select * from `products`
---
    public function index()
    {
        return view('dashboard.products.index', [
            'products' => Product::all()
        ]);