app/Http/Controllers/AppController.php

    public function home() {
        return view('home', [
            'title' => 'Home',
            'products' => Product::all(),
            'designs' => Design::all()
---
select * from `products`
select * from `designs`