app/Http/Controllers/DashboardDesignController.php

    public function index()
    {
        return view('dashboard.designs.index', [
            'designs' => Design::where('seller_id', Auth::user()->id)->get()
        ]);
---
select * from `designs` where `seller_id` = 1

    public function create()
    {
        return view('dashboard.designs.create', [
            'products' => Product::all(),
            'categories' => Category::all()
        ]);
---
select * from `products`
select * from `categories`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'title' => 'required|max:255',
            'slug' => 'required|unique:designs',
            'product_id' => 'required',
            'category_id' => 'required',
            'price' => 'required',
            'stock' => 'required',
            'image' => 'image|file|max:1024',
            'description' => 'required'
        ]);

        if($request->file('image')) {
            $validatedData['image'] = $request->file('image')->store('design-images');
        }

        $validatedData['seller_id'] = Auth::user()->id;

        Design::create($validatedData);
---
insert into `designs` (`title`, `slug`, `product_id`, `category_id`, `price`, `stock`, `image`, `description`, `seller_id`, `updated_at`, `created_at`) values ('test', 'test', '1', '3', '100', '1', 'design-images/x3uY4Xmt4jqzKL5SGtsJft9Ss5U6p7IxumtmoX2H.png', '<div>test.</div>', 1, '2024-12-28 03:49:41', '2024-12-28 03:49:41')

    public function getCategoriesByProduct($productId)
    {
        $categories = Category::where('product_id', $productId)->get();
---
select * from `categories` where `product_id` = '1'

    public function destroy(Design $design)
    {
        if($design->image) {
            Storage::delete($design->image);
        }
        Design::destroy($design->id);

        return redirect()->route('admin.designs.index')->with('success', 'Design has been deleted!');
---
delete from `designs` where `id` = 24
select * from `designs` where `id` in (24)