app/Http/Controllers/DesignController.php

select * from `categories` where `categories`.`id` in (1, 2, 3, 5, 7, 15)
select * from `products` where `products`.`id` in (1, 2, 3)
---
        if (request('author')) {
            $author = User::firstWhere('username', request('author'));
            $title .= ' by ' . $author->name;
            return view('designs.designsFiltered', [
                'title' => $title,
                'designs' => Design::latest()->filter(request(['search', 'product', 'category', 'author']))->paginate(7)->withQueryString()
            ]);