app/Http/Controllers/DesignController.php

    public function index()
    {
        $title = 'All Designs';
        $designs = Design::latest()->paginate(8);

        $avgDesignRating = DB::table('designs as d')
                ->leftJoin('design_reviews as dr', 'd.id', '=', 'dr.design_id')
                ->select('d.id')
                ->selectRaw('IFNULL(ROUND(AVG(dr.rating), 2), 0) as avg_rating')
                ->groupBy('d.id')
                ->pluck('avg_rating', 'd.id');

        $soldQuantities = DB::table('transaction_designs as td')
                ->join('transactions as t', 'td.transaction_id', '=', 't.id')
                ->select('td.design_id', DB::raw('SUM(td.quantity) as sold_quantity'))
                ->where('t.transaction_status', '=', 'Completed')
                ->groupBy('td.design_id')
                ->pluck('sold_quantity', 'td.design_id');

        return view('designs.designs', [
            'title' => $title,
            'designs' => $designs,
            'products' => Product::all(),
            'categories' => Category::all(),
            'sellers' => User::has('designs')->get(),
---
select * from `designs` order by `created_at` desc limit 8 offset 0
select count(*) as aggregate from `designs`
select `d`.`id`, IFNULL(ROUND(AVG(dr.rating), 2), 0) as avg_rating from `designs` as `d` left join `design_reviews` as `dr` on `d`.`id` = `dr`.`design_id` group by `d`.`id`
select `td`.`design_id`, SUM(td.quantity) as sold_quantity from `transaction_designs` as `td` inner join `transactions` as `t` on `td`.`transaction_id` = `t`.`id` where `t`.`transaction_status` = 'Completed' group by `td`.`design_id`
select * from `products`
select * from `categories`
select * from `users` where exists (select * from `designs` where `users`.`id` = `designs`.`seller_id`)